Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidFolderName(System.String)
Checks whether the folder name is valid.
folderName:
The folder name to check.
Returns:
True if the name is a valid folder name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.IsValidResourceName(System.String)
Checks whether the resource name is valid.
resourceName:
The resource name to check.
Returns:
True if the name is a valid resource name, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExternalResourceBrowserData.AddSubFolder(System.String,System.String)
Adds a subfolder to the folder path with the given name and icon type.
folderName:
The name of the folder.
iconPath:
Icon path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The folderName is not a valid folder name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceBrowserData.AddSubFolder(System.String)
Adds a subfolder to the folder path with the given name.
folderName:
The name of the folder.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The folderName is not a valid folder name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.String,System.Collections.Generic.IDictionary{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name, version and reference information.
resourceName:
The unique short name of external resource.
version:
The version of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.String)
Adds an external resource to the folder path by supplying the resource name and version.
resourceName:
The unique short name of external resource.
version:
The version of external resource.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String,System.Collections.Generic.IDictionary{System.String,System.String})
Adds an external resource to the folder path by supplying the resource name and reference information.
resourceName:
The unique short name of external resource.
referenceInformation:
The (String, String) map containing reference or lookup information that will
be stored in Revit.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.AddResource(System.String)
Adds an external resource to the folder path by supplying the resource name.
resourceName:
The unique short name of external resource.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The resourceName is not a valid resource name used to display in Revit external resource browse UI.
The name should be a unique non-empty short name and it should not contain any invalid character of \\/:*?"<>|.
The length of combined path(server name + folder path + resourceName) should not exceeds 259.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.ExternalResourceBrowserData.#ctor(Autodesk.Revit.DB.Document,System.Guid,System.String,Autodesk.Revit.DB.ExternalResourceMatchOptions)
Constructs a new ExternalResourceBrowserData using the given document(optional), server id, folder path and match options.
document:
The document for which the external resource browser data is requested.
The document can be null, if so, the getCallingDocumentModelPath() will not return ModelPath.
serverId:
The id of IExternalResourceServer which handles the external resource browsing and loading.
folderPath:
The folder path to which the external resources and subfolders belong.
The folder separator should always be "/" and "/" always represents the root folder for the server.The interpretation of what a folder represents is up to the server.
For example, the folder "/English/Keynote" might be a physical folder on a disk, or a table or key in a database.
matchOptions:
The options to match the external resources and folders.
Generally, the returned resources should match the options, otherwise the resource may be regarded
as invalid which may not be available in browser dialogs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015